In [1]:
import pandas as pd
import numpy as np

In [14]:
newdf=pd.read_csv('rating.csv')

In [15]:
newdf.head()

      ID Department     Office  Rating
0  U2F26    Finance  New Delhi     3.4
1  U2M61  Marketing  New Delhi     3.9
2  U1S15      Sales  New Delhi     2.8
3  U1H87         HR     Mumbai     2.1
4  U1S51      Sales  New Delhi     4.6

In [16]:
newdf['Training']=newdf.Rating.apply(lambda x: 'Yes' if x<= 3.5 else 'No')

In [17]:
newdf

        ID Department     Office  Rating Training
0    U2F26    Finance  New Delhi     3.4      Yes
1    U2M61  Marketing  New Delhi     3.9       No
2    U1S15      Sales  New Delhi     2.8      Yes
3    U1H87         HR     Mumbai     2.1      Yes
4    U1S51      Sales  New Delhi     4.6       No
..     ...        ...        ...     ...      ...
528  U3S44      Sales  New Delhi     4.8       No
529  U2M11  Marketing  Bangalore     2.5      Yes
530  U3F53    Finance  Bangalore     3.2      Yes
531  U3S46      Sales  Bangalore     2.9      Yes
532  U3S28      Sales  New Delhi     2.9      Yes

[533 rows x 5 columns]

In [36]:
newdf[(newdf['Department']=='HR')]

        ID Department     Office  Rating Training
3    U1H87         HR     Mumbai     2.1      Yes
5    U1H78         HR  New Delhi     3.8       No
9    U2H84         HR  Bangalore     4.3       No
14   U1H39         HR  New Delhi     4.2       No
21   U2H45         HR  New Delhi     3.7       No
..     ...        ...        ...     ...      ...
508  U3H28         HR  Bangalore     4.8       No
509  U3H73         HR  New Delhi     4.0       No
511  U1H70         HR  New Delhi     3.4      Yes
513  U3H87         HR  Bangalore     3.7       No
514  U3H91         HR  New Delhi     3.1      Yes

[131 rows x 5 columns]

In [21]:
67*100/134 #finance

50.0

In [26]:
74*100/138  #mnarketing

53.6231884057971

In [29]:
66*100/130   #sales

50.76923076923077

In [38]:
56*100/131  #hr

42.74809160305343

In [43]:
newdf.groupby(by='Department').mean().sort_values('Rating',ascending=False)

              Rating
Department
HR          3.661240
Sales       3.562698
Marketing   3.509559
Finance     3.472180

In [44]:
newdf

        ID Department     Office  Rating Training
0    U2F26    Finance  New Delhi     3.4      Yes
1    U2M61  Marketing  New Delhi     3.9       No
2    U1S15      Sales  New Delhi     2.8      Yes
3    U1H87         HR     Mumbai     2.1      Yes
4    U1S51      Sales  New Delhi     4.6       No
..     ...        ...        ...     ...      ...
528  U3S44      Sales  New Delhi     4.8       No
529  U2M11  Marketing  Bangalore     2.5      Yes
530  U3F53    Finance  Bangalore     3.2      Yes
531  U3S46      Sales  Bangalore     2.9      Yes
532  U3S28      Sales  New Delhi     2.9      Yes

[533 rows x 5 columns]

In [48]:
df10=newdf.groupby(by='Department')
type(df10)

pandas.core.groupby.generic.DataFrameGroupBy